# import modules

In [11]:
from pandas import read_csv

# read the data

In [12]:
filename = 'daily_retail_price_Onion-upto_apr_2015.csv'
header_names = ['Date','Centre_Name','Commodity_Name','Price']
data = read_csv(filename,names = header_names)

# display data

In [13]:
data

            Date      Centre_Name Commodity_Name  Price
0       25-11-97            DELHI          Onion    8.0
1       25-11-97           SHIMLA          Onion    7.0
2       25-11-97          LUCKNOW          Onion    5.0
3       25-11-97        AHMEDABAD          Onion    6.0
4       25-11-97           BHOPAL          Onion    8.0
...          ...              ...            ...    ...
127906  28-04-15         DINDIGUL          Onion   18.0
127907  28-04-15  THIRUCHIRAPALLI          Onion   18.0
127908  28-04-15       COIMBATORE          Onion   18.0
127909  28-04-15      TIRUNELVELI          Onion   18.0
127910  28-04-15        HYDERABAD          Onion   22.0

[127911 rows x 4 columns]

# loc commad

In [14]:
data.loc[:,['Centre_Name', 'Price']]

            Centre_Name  Price
0                 DELHI    8.0
1                SHIMLA    7.0
2               LUCKNOW    5.0
3             AHMEDABAD    6.0
4                BHOPAL    8.0
...                 ...    ...
127906         DINDIGUL   18.0
127907  THIRUCHIRAPALLI   18.0
127908       COIMBATORE   18.0
127909      TIRUNELVELI   18.0
127910        HYDERABAD   22.0

[127911 rows x 2 columns]

In [15]:
data.loc[110:120:,['Date', 'Price']]

         Date  Price
110  03-12-97    6.0
111  03-12-97    7.0
112  03-12-97    8.0
113  03-12-97   10.0
114  03-12-97    6.0
115  03-12-97   10.5
116  03-12-97    9.0
117  03-12-97   11.0
118  03-12-97    NaN
119  03-12-97   18.0
120  03-12-97    9.0

In [16]:
print(data.loc[data['Price'] < 20, ['Price', 'Commodity_Name']])

        Price Commodity_Name
0         8.0          Onion
1         7.0          Onion
2         5.0          Onion
3         6.0          Onion
4         8.0          Onion
...       ...            ...
127905   19.0          Onion
127906   18.0          Onion
127907   18.0          Onion
127908   18.0          Onion
127909   18.0          Onion

[81899 rows x 2 columns]

In [17]:
data.loc[0,:]

Date              25-11-97
Centre_Name          DELHI
Commodity_Name       Onion
Price                    8
Name: 0, dtype: object

In [18]:
data.loc[10:20:,'Commodity_Name':'Price']

   Commodity_Name  Price
10          Onion    8.0
11          Onion    9.0
12          Onion    9.0
13          Onion    9.0
14          Onion    6.0
15          Onion    6.5
16          Onion    5.0
17          Onion    6.0
18          Onion    8.0
19          Onion    7.0
20          Onion    5.0

In [19]:
data.loc[0:4,:]

       Date Centre_Name Commodity_Name  Price
0  25-11-97       DELHI          Onion    8.0
1  25-11-97      SHIMLA          Onion    7.0
2  25-11-97     LUCKNOW          Onion    5.0
3  25-11-97   AHMEDABAD          Onion    6.0
4  25-11-97      BHOPAL          Onion    8.0

In [20]:
data.loc[0,:]

Date              25-11-97
Centre_Name          DELHI
Commodity_Name       Onion
Price                    8
Name: 0, dtype: object

# iloc command

In [21]:
data.iloc[3:7,1:3] # [row start:row end, column start: column end]

  Centre_Name Commodity_Name
3   AHMEDABAD          Onion
4      BHOPAL          Onion
5      MUMBAI          Onion
6      JAIPUR          Onion

In [22]:
data.iloc[:,:]

            Date      Centre_Name Commodity_Name  Price
0       25-11-97            DELHI          Onion    8.0
1       25-11-97           SHIMLA          Onion    7.0
2       25-11-97          LUCKNOW          Onion    5.0
3       25-11-97        AHMEDABAD          Onion    6.0
4       25-11-97           BHOPAL          Onion    8.0
...          ...              ...            ...    ...
127906  28-04-15         DINDIGUL          Onion   18.0
127907  28-04-15  THIRUCHIRAPALLI          Onion   18.0
127908  28-04-15       COIMBATORE          Onion   18.0
127909  28-04-15      TIRUNELVELI          Onion   18.0
127910  28-04-15        HYDERABAD          Onion   22.0

[127911 rows x 4 columns]

In [23]:
print(data.iloc[[0,3,6,24], [0,2,3]]) # you can select specific rows and specific columns

        Date Commodity_Name  Price
0   25-11-97          Onion    8.0
3   25-11-97          Onion    6.0
6   25-11-97          Onion    6.0
24  26-11-97          Onion    6.0

In [24]:
data.iloc[0:3,0:4]

       Date Centre_Name Commodity_Name  Price
0  25-11-97       DELHI          Onion    8.0
1  25-11-97      SHIMLA          Onion    7.0
2  25-11-97     LUCKNOW          Onion    5.0

In [25]:
data.iloc[0:3,0:3]

       Date Centre_Name Commodity_Name
0  25-11-97       DELHI          Onion
1  25-11-97      SHIMLA          Onion
2  25-11-97     LUCKNOW          Onion

In [26]:
print(data.iloc[0:5]) # first five rows of dataframe

print(data.iloc[:, 0:2]) # first two columns of data frame with all rows

       Date Centre_Name Commodity_Name  Price
0  25-11-97       DELHI          Onion    8.0
1  25-11-97      SHIMLA          Onion    7.0
2  25-11-97     LUCKNOW          Onion    5.0
3  25-11-97   AHMEDABAD          Onion    6.0
4  25-11-97      BHOPAL          Onion    8.0
            Date      Centre_Name
0       25-11-97            DELHI
1       25-11-97           SHIMLA
2       25-11-97          LUCKNOW
3       25-11-97        AHMEDABAD
4       25-11-97           BHOPAL
...          ...              ...
127906  28-04-15         DINDIGUL
127907  28-04-15  THIRUCHIRAPALLI
127908  28-04-15       COIMBATORE
127909  28-04-15      TIRUNELVELI
127910  28-04-15        HYDERABAD

[127911 rows x 2 columns]

In [27]:
data.iloc[:,-2] # last column of data frame

0         Onion
1         Onion
2         Onion
3         Onion
4         Onion
          ...
127906    Onion
127907    Onion
127908    Onion
127909    Onion
127910    Onion
Name: Commodity_Name, Length: 127911, dtype: object

In [28]:
data.iloc[:,1] # second column of data frame

0                   DELHI
1                  SHIMLA
2                 LUCKNOW
3               AHMEDABAD
4                  BHOPAL
               ...
127906           DINDIGUL
127907    THIRUCHIRAPALLI
127908         COIMBATORE
127909        TIRUNELVELI
127910          HYDERABAD
Name: Centre_Name, Length: 127911, dtype: object

In [29]:
print(data.iloc[[0,3,6,24], [0,2,3]])

print(data.iloc[0:5, 2:4])

        Date Commodity_Name  Price
0   25-11-97          Onion    8.0
3   25-11-97          Onion    6.0
6   25-11-97          Onion    6.0
24  26-11-97          Onion    6.0
  Commodity_Name  Price
0          Onion    8.0
1          Onion    7.0
2          Onion    5.0
3          Onion    6.0
4          Onion    8.0

In [17]:
data[data.columns[1:3]]

            Centre_Name Commodity_Name
0                 DELHI          Onion
1                SHIMLA          Onion
2               LUCKNOW          Onion
3             AHMEDABAD          Onion
4                BHOPAL          Onion
...                 ...            ...
127906         DINDIGUL          Onion
127907  THIRUCHIRAPALLI          Onion
127908       COIMBATORE          Onion
127909      TIRUNELVELI          Onion
127910        HYDERABAD          Onion

[127911 rows x 2 columns]

In [39]:
data.loc[110:120:,['Date', 'Price']]

         Date  Price
110  03-12-97    6.0
111  03-12-97    7.0
112  03-12-97    8.0
113  03-12-97   10.0
114  03-12-97    6.0
115  03-12-97   10.5
116  03-12-97    9.0
117  03-12-97   11.0
118  03-12-97    NaN
119  03-12-97   18.0
120  03-12-97    9.0

In [39]:
print(data.loc[data['Price'] < 20, ['Price', 'Commodity_Name']]) 
print("\n -- iloc -- \n")
print(data.iloc[(data['Price'] < 30).values, [1, 3]])

        Price Commodity_Name
0         8.0          Onion
1         7.0          Onion
2         5.0          Onion
3         6.0          Onion
4         8.0          Onion
...       ...            ...
127905   19.0          Onion
127906   18.0          Onion
127907   18.0          Onion
127908   18.0          Onion
127909   18.0          Onion

[81899 rows x 2 columns]

 -- iloc --

            Centre_Name  Price
0                 DELHI    8.0
1                SHIMLA    7.0
2               LUCKNOW    5.0
3             AHMEDABAD    6.0
4                BHOPAL    8.0
...                 ...    ...
127906         DINDIGUL   18.0
127907  THIRUCHIRAPALLI   18.0
127908       COIMBATORE   18.0
127909      TIRUNELVELI   18.0
127910        HYDERABAD   22.0

[104357 rows x 2 columns]

In [18]:
data.iloc[:,-1] # last row of data frame [3:9,1:3p
print(data.iloc[5:10, 1:4])
print(data.iloc[:,3])
print(4,3)
#print(data.iloc[:,-1])

    Centre_Name Commodity_Name  Price
5        MUMBAI          Onion    7.0
6        JAIPUR          Onion    6.0
7         PATNA          Onion    NaN
8  BHUBANESHWAR          Onion    9.0
9       KOLKATA          Onion   11.0
0          8.0
1          7.0
2          5.0
3          6.0
4          8.0
          ...
127906    18.0
127907    18.0
127908    18.0
127909    18.0
127910    22.0
Name: Price, Length: 127911, dtype: float64
4 3

In [45]:
data.iloc[10:20,-1]

10    8.0
11    9.0
12    9.0
13    9.0
14    6.0
15    6.5
16    5.0
17    6.0
18    8.0
19    7.0
Name: Price, dtype: float64

In [21]:
data.iloc[:,1:4]

            Centre_Name Commodity_Name  Price
0                 DELHI          Onion    8.0
1                SHIMLA          Onion    7.0
2               LUCKNOW          Onion    5.0
3             AHMEDABAD          Onion    6.0
4                BHOPAL          Onion    8.0
...                 ...            ...    ...
127906         DINDIGUL          Onion   18.0
127907  THIRUCHIRAPALLI          Onion   18.0
127908       COIMBATORE          Onion   18.0
127909      TIRUNELVELI          Onion   18.0
127910        HYDERABAD          Onion   22.0

[127911 rows x 3 columns]

In [135]:
# Single selections using iloc and DataFrame
# Rows:
data.iloc[0] # first row of data frame

Date              25-11-97
Centre_Name          DELHI
Commodity_Name       Onion
Price                    8
Name: 0, dtype: object

In [136]:
data.iloc[1] # second row of data frame

Date              25-11-97
Centre_Name         SHIMLA
Commodity_Name       Onion
Price                    7
Name: 1, dtype: object

In [138]:
data.iloc[:,0] # first column of data frame

0         25-11-97
1         25-11-97
2         25-11-97
3         25-11-97
4         25-11-97
            ...
127906    28-04-15
127907    28-04-15
127908    28-04-15
127909    28-04-15
127910    28-04-15
Name: Date, Length: 127911, dtype: object